GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k40.h
extern volatile PIE3bits_t PIE3bits __at(0xEC5);
// bitfield macros
#define _PIE3_SSP1IE_POSN                                   0x0
#define _PIE3_SSP1IE_POSITION                               0x0
#define _PIE3_SSP1IE_SIZE                                   0x1
#define _PIE3_SSP1IE_LENGTH                                 0x1
#define _PIE3_SSP1IE_MASK                                   0x1
#define _PIE3_BCL1IE_POSN                                   0x1
#define _PIE3_BCL1IE_POSITION                               0x1
#define _PIE3_BCL1IE_SIZE                                   0x1
#define _PIE3_BCL1IE_LENGTH                                 0x1
#define _PIE3_BCL1IE_MASK                                   0x2
#define _PIE3_SSP2IE_POSN                                   0x2
#define _PIE3_SSP2IE_POSITION                               0x2
#define _PIE3_SSP2IE_SIZE                                   0x1
#define _PIE3_SSP2IE_LENGTH                                 0x1
#define _PIE3_SSP2IE_MASK                                   0x4
#define _PIE3_BCL2IE_POSN                                   0x3
#define _PIE3_BCL2IE_POSITION                               0x3
#define _PIE3_BCL2IE_SIZE                                   0x1
#define _PIE3_BCL2IE_LENGTH                                 0x1
#define _PIE3_BCL2IE_MASK                                   0x8
#define _PIE3_TX1IE_POSN                                    0x4
#define _PIE3_TX1IE_POSITION                                0x4
#define _PIE3_TX1IE_SIZE                                    0x1
#define _PIE3_TX1IE_LENGTH                                  0x1
#define _PIE3_TX1IE_MASK                                    0x10
#define _PIE3_RC1IE_POSN                                    0x5
#define _PIE3_RC1IE_POSITION                                0x5
#define _PIE3_RC1IE_SIZE                                    0x1
#define _PIE3_RC1IE_LENGTH                                  0x1
#define _PIE3_RC1IE_MASK                                    0x20
#define _PIE3_TX2IE_POSN                                    0x6
#define _PIE3_TX2IE_POSITION                                0x6
#define _PIE3_TX2IE_SIZE                                    0x1
#define _PIE3_TX2IE_LENGTH                                  0x1
#define _PIE3_TX2IE_MASK                                    0x40
#define _PIE3_RC2IE_POSN                                    0x7
#define _PIE3_RC2IE_POSITION                                0x7
#define _PIE3_RC2IE_SIZE                                    0x1
#define _PIE3_RC2IE_LENGTH                                  0x1
#define _PIE3_RC2IE_MASK                                    0x80
#define _PIE3_RXB0IE_POSN                                   0x0
#define _PIE3_RXB0IE_POSITION                               0x0
#define _PIE3_RXB0IE_SIZE                                   0x1
#define _PIE3_RXB0IE_LENGTH                                 0x1
#define _PIE3_RXB0IE_MASK                                   0x1
#define _PIE3_RXB1IE_POSN                                   0x1
#define _PIE3_RXB1IE_POSITION                               0x1
#define _PIE3_RXB1IE_SIZE                                   0x1
#define _PIE3_RXB1IE_LENGTH                                 0x1
#define _PIE3_RXB1IE_MASK                                   0x2
#define _PIE3_TXB0IE_POSN                                   0x2
#define _PIE3_TXB0IE_POSITION                               0x2
#define _PIE3_TXB0IE_SIZE                                   0x1
#define _PIE3_TXB0IE_LENGTH                                 0x1
#define _PIE3_TXB0IE_MASK                                   0x4
#define _PIE3_TXB1IE_POSN                                   0x3
#define _PIE3_TXB1IE_POSITION                               0x3
#define _PIE3_TXB1IE_SIZE                                   0x1
#define _PIE3_TXB1IE_LENGTH                                 0x1
#define _PIE3_TXB1IE_MASK                                   0x8
#define _PIE3_TXB2IE_POSN                                   0x4
#define _PIE3_TXB2IE_POSITION                               0x4
#define _PIE3_TXB2IE_SIZE                                   0x1
#define _PIE3_TXB2IE_LENGTH                                 0x1
#define _PIE3_TXB2IE_MASK                                   0x10
#define _PIE3_RXBNIE_POSN                                   0x1
#define _PIE3_RXBNIE_POSITION                               0x1
#define _PIE3_RXBNIE_SIZE                                   0x1
#define _PIE3_RXBNIE_LENGTH                                 0x1
#define _PIE3_RXBNIE_MASK                                   0x2
#define _PIE3_TXBNIE_POSN                                   0x4
#define _PIE3_TXBNIE_POSITION                               0x4
#define _PIE3_TXBNIE_SIZE                                   0x1
#define _PIE3_TXBNIE_LENGTH                                 0x1
#define _PIE3_TXBNIE_MASK                                   0x10

// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0xEC6);
#ifndef _LIB_BUILD
asm("PIE4 equ 0EC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR3IE                 :1;
        unsigned TMR4IE                 :1;
        unsigned TMR5IE                 :1;
        unsigned TMR6IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0xEC6);
// bitfield macros
#define _PIE4_TMR1IE_POSN                                   0x0
#define _PIE4_TMR1IE_POSITION                               0x0
#define _PIE4_TMR1IE_SIZE                                   0x1
#define _PIE4_TMR1IE_LENGTH                                 0x1
#define _PIE4_TMR1IE_MASK                                   0x1
#define _PIE4_TMR2IE_POSN                                   0x1
#define _PIE4_TMR2IE_POSITION                               0x1
#define _PIE4_TMR2IE_SIZE                                   0x1
#define _PIE4_TMR2IE_LENGTH                                 0x1
#define _PIE4_TMR2IE_MASK                                   0x2
#define _PIE4_TMR3IE_POSN                                   0x2
#define _PIE4_TMR3IE_POSITION                               0x2
#define _PIE4_TMR3IE_SIZE                                   0x1
#define _PIE4_TMR3IE_LENGTH                                 0x1
#define _PIE4_TMR3IE_MASK                                   0x4
#define _PIE4_TMR4IE_POSN                                   0x3
#define _PIE4_TMR4IE_POSITION                               0x3
#define _PIE4_TMR4IE_SIZE                                   0x1
#define _PIE4_TMR4IE_LENGTH                                 0x1
#define _PIE4_TMR4IE_MASK                                   0x8
#define _PIE4_TMR5IE_POSN                                   0x4
#define _PIE4_TMR5IE_POSITION                               0x4
#define _PIE4_TMR5IE_SIZE                                   0x1
#define _PIE4_TMR5IE_LENGTH                                 0x1
#define _PIE4_TMR5IE_MASK                                   0x10
#define _PIE4_TMR6IE_POSN                                   0x5
#define _PIE4_TMR6IE_POSITION                               0x5
#define _PIE4_TMR6IE_SIZE                                   0x1
#define _PIE4_TMR6IE_LENGTH                                 0x1
#define _PIE4_TMR6IE_MASK                                   0x20

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0xEC7);
#ifndef _LIB_BUILD
asm("PIE5 equ 0EC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIE                :1;
        unsigned TMR3GIE                :1;
        unsigned TMR5GIE                :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0xEC7);
// bitfield macros
#define _PIE5_TMR1GIE_POSN                                  0x0
#define _PIE5_TMR1GIE_POSITION                              0x0
#define _PIE5_TMR1GIE_SIZE                                  0x1
#define _PIE5_TMR1GIE_LENGTH                                0x1
#define _PIE5_TMR1GIE_MASK                                  0x1
#define _PIE5_TMR3GIE_POSN                                  0x1
#define _PIE5_TMR3GIE_POSITION                              0x1
#define _PIE5_TMR3GIE_SIZE                                  0x1
#define _PIE5_TMR3GIE_LENGTH                                0x1
#define _PIE5_TMR3GIE_MASK                                  0x2
#define _PIE5_TMR5GIE_POSN                                  0x2
#define _PIE5_TMR5GIE_POSITION                              0x2
#define _PIE5_TMR5GIE_SIZE                                  0x1
#define _PIE5_TMR5GIE_LENGTH                                0x1
#define _PIE5_TMR5GIE_MASK                                  0x4

