GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k40.h
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x7BF7);	// @ (0xF7E * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDAT<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDAT,0)
// NVMDAT<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDAT,1)
// NVMDAT<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDAT,2)
// NVMDAT<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDAT,3)
// NVMDAT<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDAT,4)
// NVMDAT<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDAT,5)
// NVMDAT<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDAT,6)
// NVMDAT<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDAT,7)
// PIE7<NVMIE>
extern volatile __bit                   NVMIE               __at(0x764D);	// @ (0xEC9 * 8 + 5)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE7,5)
// PIR7<NVMIF>
extern volatile __bit                   NVMIF               __at(0x768D);	// @ (0xED1 * 8 + 5)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR7,5)
// IPR7<NVMIP>
extern volatile __bit                   NVMIP               __at(0x760D);	// @ (0xEC1 * 8 + 5)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR7,5)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x770A);	// @ (0xEE1 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREG0>
extern volatile __bit                   NVMREG0             __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 NVMREG0_bit         _BIT_ACCESS(NVMCON1,6)
// NVMCON1<NVMREG1>
extern volatile __bit                   NVMREG1             __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 NVMREG1_bit         _BIT_ACCESS(NVMCON1,7)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x787C);	// @ (0xF0F * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x787D);	// @ (0xF0F * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x787E);	// @ (0xF0F * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x787F);	// @ (0xF0F * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x78FE);	// @ (0xF1F * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x799D);	// @ (0xF33 * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<OE2>
extern volatile __bit                   OE2                 __at(0x799C);	// @ (0xF33 * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC1CON0,4)
// MDCON0<OPOL>
extern volatile __bit                   OPOL                __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MDCON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE1<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE1,7)
// PIR1<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR1,7)
// IPR1<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR1,7)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x7A44);	// @ (0xF48 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x7A45);	// @ (0xF48 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x7A46);	// @ (0xF48 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x7A47);	// @ (0xF48 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// CCPTMRS<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x7D74);	// @ (0xFAE * 8 + 4)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS,4)
// CCPTMRS<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x7D75);	// @ (0xFAE * 8 + 5)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS,5)
// CCPTMRS<P4TSEL0>
extern volatile __bit                   P4TSEL0             __at(0x7D76);	// @ (0xFAE * 8 + 6)
#define                                 P4TSEL0_bit         _BIT_ACCESS(CCPTMRS,6)
// CCPTMRS<P4TSEL1>
extern volatile __bit                   P4TSEL1             __at(0x7D77);	// @ (0xFAE * 8 + 7)
#define                                 P4TSEL1_bit         _BIT_ACCESS(CCPTMRS,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C8F);	// @ (0xF91 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C8E);	// @ (0xF91 * 8 + 6)
#define                                 PB1E_bit            _BIT_ACCESS(PORTE,6)
// PORTE<PB2>
extern volatile __bit                   PB2                 __at(0x7C8A);	// @ (0xF91 * 8 + 2)
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<PB3E>
extern volatile __bit                   PB3E                __at(0x7C8C);	// @ (0xF91 * 8 + 4)
#define                                 PB3E_bit            _BIT_ACCESS(PORTE,4)
// PORTE<PC1E>
extern volatile __bit                   PC1E                __at(0x7C8D);	// @ (0xF91 * 8 + 5)
#define                                 PC1E_bit            _BIT_ACCESS(PORTE,5)
// PORTE<PC2>
extern volatile __bit                   PC2                 __at(0x7C89);	// @ (0xF91 * 8 + 1)
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C8B);	// @ (0xF91 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// STATUS<PD>
extern volatile __bit                   PD                  __at(0x7EC5);	// @ (0xFD8 * 8 + 5)
#define                                 PD_bit              _BIT_ACCESS(STATUS,5)
// PORTE<PD2>
extern volatile __bit                   PD2                 __at(0x7C88);	// @ (0xF91 * 8 + 0)
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7CBA);	// @ (0xF97 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x74BA);	// @ (0xE97 * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x7BE8);	// @ (0xF7D * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x7BE9);	// @ (0xF7D * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x7BEA);	// @ (0xF7D * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x7BEB);	// @ (0xF7D * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x76D8);	// @ (0xEDB * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x7A28);	// @ (0xF45 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x7A29);	// @ (0xF45 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x7A2A);	// @ (0xF45 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x7A2B);	// @ (0xF45 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x7EB9);	// @ (0xFD7 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x76AA);	// @ (0xED5 * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x76AB);	// @ (0xED5 * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x76AC);	// @ (0xED5 * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x76AD);	// @ (0xED5 * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x76AE);	// @ (0xED5 * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x76AF);	// @ (0xED5 * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x76B0);	// @ (0xED6 * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x76B1);	// @ (0xED6 * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x76A6);	// @ (0xED4 * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x76A7);	// @ (0xED4 * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x76A8);	// @ (0xED5 * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x76A9);	// @ (0xED5 * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// DAC1CON0<PSS0>
extern volatile __bit                   PSS0                __at(0x799A);	// @ (0xF33 * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<PSS1>
extern volatile __bit                   PSS1                __at(0x799B);	// @ (0xF33 * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON0,3)
// PWM3DCL<PWM3DC0>
extern volatile __bit                   PWM3DC0             __at(0x7D1E);	// @ (0xFA3 * 8 + 6)
#define                                 PWM3DC0_bit         _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DC1>
extern volatile __bit                   PWM3DC1             __at(0x7D1F);	// @ (0xFA3 * 8 + 7)
#define                                 PWM3DC1_bit         _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<PWM3DC2>
extern volatile __bit                   PWM3DC2             __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 PWM3DC2_bit         _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DC3>
extern volatile __bit                   PWM3DC3             __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 PWM3DC3_bit         _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DC4>
extern volatile __bit                   PWM3DC4             __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 PWM3DC4_bit         _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DC5>
extern volatile __bit                   PWM3DC5             __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 PWM3DC5_bit         _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DC6>
extern volatile __bit                   PWM3DC6             __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 PWM3DC6_bit         _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DC7>
extern volatile __bit                   PWM3DC7             __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 PWM3DC7_bit         _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DC8>
extern volatile __bit                   PWM3DC8             __at(0x7D26);	// @ (0xFA4 * 8 + 6)
#define                                 PWM3DC8_bit         _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DC9>
extern volatile __bit                   PWM3DC9             __at(0x7D27);	// @ (0xFA4 * 8 + 7)
#define                                 PWM3DC9_bit         _BIT_ACCESS(PWM3DCH,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x7D2F);	// @ (0xFA5 * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PMD3<PWM3MD>
extern volatile __bit                   PWM3MD              __at(0x7722);	// @ (0xEE4 * 8 + 2)
